lab11/powerblade/software/nrf51822/apps/powerblade/main.c
    // turn off UART until next window
    uart_rx_disable();

    // a new window for transmission to the MSP430 is available
    already_transmitted = false;

    // check CRC
    if (!overrun && additive_checksum(rx_data, packet_len-1) == rx_data[packet_len-1]) {

        // check validity of advertisement length
        uint8_t adv_len = rx_data[2];
        if (4+adv_len <= packet_len) {

            // limit to valid advertisement length
            if (adv_len > ADV_DATA_MAX_LEN) {
                adv_len = ADV_DATA_MAX_LEN;
            }

            // update advertisement
            //  first byte of adv_data is service_id, skip it
            //NOTE: this is safe to call no matter where in the
            //  Eddystone/Manuf Data we are. If called during Manuf Data,
            //  nothing changes (second call to timer_start does nothing).
            //  If called during Eddystone, timing is screwed up, but it'll fix
            //  itself within one cycle
            powerblade_adv_data_len = 1+adv_len;
            memcpy(&(powerblade_adv_data[1]), &(rx_data[3]), adv_len);

            //XXX: Hack to test waveform transmission
            if (packet_len > 4+adv_len) {
                // I think this might add 100 to flags...?
                powerblade_adv_data[1+adv_len-1] += 100;
            }

            start_manufdata_adv();

            // handle additional UART data, if any
            uint8_t* additional_data = &(rx_data[3+adv_len]);
            uint16_t additional_data_length = packet_len - (4 + adv_len);
            on_receive_message(additional_data, additional_data_length);
        }
    } else {
        // need to send a nak
        nak_state = NAK_CHECKSUM;
        status_code = STATUS_BAD_CHECKSUM;
        simple_ble_notify_char(&config_status_char);
    }
}

void uart_tx_handler (void) {
    static uint16_t tx_index = 0;

    // clear event
    nrf_uart_event_clear(NRF_UART0, NRF_UART_EVENT_TXDRDY);

    // check if there is more data to send
    if (tx_index < tx_data_len) {
        nrf_uart_txd_set(NRF_UART0, tx_data[tx_index]);
        tx_index++;
    } else {
        tx_index = 0;
        uart_tx_disable();
    }
}

void uart_send (uint8_t* data, uint16_t len) {
    // setup data
    tx_data = data;
    tx_data_len = len;

    // begin sending data
    uart_tx_enable();
    uart_tx_handler();

    // transmission sent for this cycle
    already_transmitted = true;
}

void uart_start_receive (void) {
    led_toggle(ERROR_LED);
    if (!skip_uart_cycle) {
        // don't allow transmissions while waiting for a packet
        already_transmitted = true;

        // reset state. If we were still looking for an old packet, it's time
        //  to give up and start over
        received_len = 0;
        rx_index = 0;

        // we are ready to receive, go for it
        receiving_bytes = true;
        uart_rx_enable();
    } else {
        // skip this reception cycle to conserve power while doing heavy
        //  lifting in BLE-land
        app_timer_start(enable_uart_timer, UART_SKIP_DURATION, NULL);
        // only skip a single cycle
        skip_uart_cycle = false;
        // if we haven't already transmitted, don't start now
        //  if we have, we won't move on to the next state for a cycle since
        //  already_transmitted will stay true
        already_transmitted = true;
    }
}


/**************************************************
 * Services
 **************************************************/

void services_init (void) {

    // Add configuration service
    simple_ble_add_service(&config_service);

        // Add characteristic to display status codes
        simple_ble_add_characteristic(1, 0, 1, 0, // read, write, notify, vlen
                sizeof(status_code), (uint8_t*)&status_code,
                &config_service, &config_status_char);

        // Add characteristic to access voff
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.voff), (uint8_t*)&powerblade_config.voff,
                &config_service, &config_voff_char);

        // Add characteristic to access ioff
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.ioff), (uint8_t*)&powerblade_config.ioff,
                &config_service, &config_ioff_char);

        // Add characteristic to access curoff
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.curoff), (uint8_t*)&powerblade_config.curoff,
                &config_service, &config_curoff_char);

        // Add characteristic to access pscale
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.pscale), (uint8_t*)&powerblade_config.pscale,
                &config_service, &config_pscale_char);

        // Add characteristic to access vscale
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.vscale), (uint8_t*)&powerblade_config.vscale,
                &config_service, &config_vscale_char);

        // Add characteristic to access whscale
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                sizeof(powerblade_config.whscale), (uint8_t*)&powerblade_config.whscale,
                &config_service, &config_whscale_char);


    // Add internal calibration service
    simple_ble_add_service(&calibration_service);

        // Add the characteristic to set calibration load wattage
        calibration_wattage = 0;
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                2, (uint8_t*)&calibration_wattage,
                &calibration_service, &calibration_wattage_char);

        // Add the characteristic to set calibration load voltage
        calibration_voltage = 0x04B0; // 1200 deci-volts
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                2, (uint8_t*)&calibration_voltage,
                &calibration_service, &calibration_voltage_char);

        // Add the characteristic to control and indicate status
        calibration_control = 0;
        simple_ble_add_characteristic(1, 1, 1, 0, // read, write, notify, vlen
                1, (uint8_t*)&calibration_control,
                &calibration_service, &calibration_control_char);

