lab11/powerblade/software/nrf51822/apps/powerblade/main.c
    // Add raw sample download service
    simple_ble_add_service(&rawSample_service);

        // Add the characteristic to signal grab sample data
        begin_rawSample = false;
        simple_ble_add_characteristic(1, 1, 0, 0, // read, write, notify, vlen
                1, (uint8_t*)&begin_rawSample,
                &rawSample_service, &rawSample_char_begin);

        // Add the characteristic to provide raw samples
        //  This characteristic requires read authorizations. This gives us the
        //  opportunity to disable the UART transmissions while before a read
        //  of it starts
        memset(raw_sample_data, 0x00, SAMDATA_MAX_LEN);
        simple_ble_add_auth_characteristic(1, 0, 0, 1, // read, write, notify, vlen
                true, false, // read auth, write auth
                SAMDATA_MAX_LEN, (uint8_t*)raw_sample_data,
                &rawSample_service, &rawSample_char_data);
        // must initialize to maximum valid length. Now reset down to 1
        simple_ble_update_char_len(&rawSample_char_data, 1);

        // Add the characteristic to provide raw samples
        rawSample_status = 2;
        simple_ble_add_characteristic(1, 1, 1, 0, // read, write, notify, vlen
                1, (uint8_t*)&rawSample_status,
                &rawSample_service, &rawSample_char_status);
}

void ble_evt_connected (ble_evt_t* p_ble_evt) {
    // a connection just started, skip the next uart cycle to save power
    skip_uart_cycle = true;

    // stop any running advertisements and don't restart for a single UART cycle
    advertising_stop();
    app_timer_stop(start_eddystone_timer);
    app_timer_stop(start_manufdata_timer);
    app_timer_start(restart_advs_timer, CONNECTION_SKIP_DURATION, NULL);
}

void ble_evt_write (ble_evt_t* p_ble_evt) {

    if (simple_ble_is_char_event(p_ble_evt, &calibration_control_char)) {
        // start or stop calibration depending on current state
        if (calibration_state == CALIB_NONE) {
            // start internal calibration
            calibration_state = CALIB_START;
        } else {
            // stop internal calibration
            calibration_state = CALIB_STOP;
        }

    } else if (simple_ble_is_char_event(p_ble_evt, &calibration_wattage_char) ||
            simple_ble_is_char_event(p_ble_evt, &calibration_voltage_char)) {
        // user just changed calibration parameters. Stop calibration if in progress
        if (calibration_state != CALIB_NONE) {
            // stop internal calibration
            calibration_state = CALIB_STOP;
        }

    } else if (simple_ble_is_char_event(p_ble_evt, &rawSample_char_begin)) {
        // start or stop collection and transfer of raw samples as appropriate
        if (rawSample_state == RS_NONE && begin_rawSample) {
            // start raw sample collection
            rawSample_state = RS_START;
            rawSample_status = 0;
        } else if (rawSample_state != RS_NONE && !begin_rawSample) {
            rawSample_state = RS_QUIT;
            rawSample_status = 255;
        }

    } else if (simple_ble_is_char_event(p_ble_evt, &rawSample_char_status)) {
        // clear value on write
        rawSample_status = 0;

        // request next data from MSP430
        if (rawSample_state == RS_IDLE) {
            rawSample_state = RS_NEXT;
        }

    } else if (simple_ble_is_char_event(p_ble_evt, &config_voff_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_ioff_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_curoff_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_pscale_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_vscale_char) ||
               simple_ble_is_char_event(p_ble_evt, &config_whscale_char)) {
        // send updated value to MSP
        config_state = CONF_SET_VALUES;
    }
}

void ble_evt_rw_auth (ble_evt_t* p_ble_evt) {
    if (simple_ble_is_read_auth_event(p_ble_evt, &rawSample_char_data)) {
        // read request for data characteristic, disable uart for a cycle and
        //  authorize the read
        skip_uart_cycle = true;
        uint32_t err_code = simple_ble_grant_auth(p_ble_evt);
        APP_ERROR_CHECK(err_code);
    }
}


/**************************************************
 * Initialization
 **************************************************/

void timers_init (void) {
    uint32_t err_code;

    err_code = app_timer_create(&enable_uart_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)uart_start_receive);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&start_eddystone_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)start_eddystone_adv);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&start_manufdata_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)start_manufdata_adv);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&restart_advs_timer, APP_TIMER_MODE_SINGLE_SHOT, (app_timer_timeout_handler_t)restart_advertisements);
    APP_ERROR_CHECK(err_code);
}

void ble_error(uint32_t error_code) {
    // display error when developing on the squall platform
    //  Has no effect on production PowerBlades
    led_init(ERROR_LED);
    led_on(ERROR_LED);
}

int main(void) {
    // Initialization
    simple_ble_app = simple_ble_init(&ble_config);
    timers_init();
    conn_params_init();
    uart_init();
    init_adv_data();

    led_init(ERROR_LED);
    led_on(ERROR_LED);

    // Initialization complete
    start_manufdata_adv();
    receiving_bytes = true;
    uart_rx_enable();

    while (1) {
        power_manage();

        // handle input bytes
        if (receiving_bytes) {
            receive_bytes();
        }

        // state machine. Only send one message per second
        if (!already_transmitted) {
            transmit_message();
        }
    }
}

void transmit_message(void) {
    // select message to transmit at this interval
    //  message priority is based on ordering in this function

    if (startup_state == STARTUP_NOP) {
        // skip this first cycle
        already_transmitted = true;
        startup_state = STARTUP_GET_CONFIG;

    } else if (nak_state == NAK_CHECKSUM) {
        // send NAK to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (UART_NAK);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        nak_state = NAK_NONE;

    } else if (nak_state == NAK_RESEND) {
        // resend most recent message to MSP
        uart_send(tx_data, tx_data_len);
        nak_state = NAK_NONE;

    } else if (calibration_state == CALIB_START) {
        // send start message to MSP
        uint16_t length = 2+1+2+2+1; // length (x2), type, wattage (x2), voltage (x2), checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (START_LOCALC);
        tx_buffer[3] = (calibration_wattage >> 8);
        tx_buffer[4] = (calibration_wattage & 0xFF);
        tx_buffer[5] = (calibration_voltage >> 8);
        tx_buffer[6] = (calibration_voltage & 0xFF);
        tx_buffer[7] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_START;

    } else if (calibration_state == CALIB_CONTINUE) {
        // check on the state of the MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (CONT_LOCALC);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_CONTINUE;

    } else if (calibration_state == CALIB_GET_CONFIG) {
        // request new configuration from MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_CONF);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_GET_CONFIG;

    } else if (calibration_state == CALIB_STOP) {
        // send stop message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (DONE_LOCALC);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = CALIB_WAIT_STOP;

    } else if (rawSample_state == RS_START) {
        // send start message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (START_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_START;

    } else if (rawSample_state == RS_NEXT) {
        // send next data message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (CONT_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_DATA;

