lab11/powerblade/software/nrf51822/apps/powerblade/main.c
    } else if (rawSample_state == RS_QUIT) {
        // send quit message to MSP
        uint16_t length = 2+1+1; // length (x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (DONE_SAMDATA);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        rawSample_state = RS_WAIT_QUIT;

    } else if (config_state == CONF_SET_VALUES) {
        // set configuration values
        uint16_t length = 2+1+sizeof(powerblade_config)+1; // length(x2), type, configuration struct, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (SET_CONF);
        memcpy(&(tx_buffer[3]), (uint8_t*)(&powerblade_config), sizeof(powerblade_config));
        tx_buffer[3+sizeof(powerblade_config)] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        config_state = CONF_NONE;

    } else if (startup_state == STARTUP_GET_CONFIG) {
        // get MSP configuration to display to user
        uint16_t length = 2+1+1; // length(x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_CONF);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        startup_state = STARTUP_GET_VERSION;

    } else if (startup_state == STARTUP_GET_VERSION) {
        // get MSP software version to display to user
        uint16_t length = 2+1+1; // length(x2), type, checksum
        tx_buffer[0] = (length >> 8);
        tx_buffer[1] = (length & 0xFF);
        tx_buffer[2] = (GET_VER);
        tx_buffer[3] = additive_checksum(tx_buffer, length-1);
        uart_send(tx_buffer, length);
        startup_state = STARTUP_NONE;
    }
}

void on_receive_message(uint8_t* buf, uint16_t len) {
    if (len > 0) {
        // switch on add data type
        uint8_t data_type = buf[0];
        switch (data_type) {
            case UART_NAK:
                status_code = STATUS_GOT_NAK;
                simple_ble_notify_char(&config_status_char);
                nak_state = NAK_RESEND;
                break;

            case GET_CONF:
                // updated configuration from the MSP
                if ((len-1) == sizeof(powerblade_config)) {
                    memcpy((uint8_t*)&powerblade_config, &(buf[1]), len-1);
                } else {
                    // data was the wrong size. Report error
                    status_code = STATUS_BAD_CONFIG_SIZE;
                    simple_ble_notify_char(&config_status_char);
                }

                // check if we are waiting on configuration to complete calibration
                if (calibration_state != CALIB_NONE) {
                    calibration_state = CALIB_NONE;
                }
                break;

            case GET_VER:
                // updated configuration from the MSP
                //TODO: copy over version number into some characteristic
                break;

            case START_LOCALC:
                // write status to characteristic
                calibration_control = 1;
                simple_ble_notify_char(&calibration_control_char);

                // MSP has begun interal calibration
                if (calibration_state != CALIB_STOP) {
                    calibration_state = CALIB_CONTINUE;
                }
                break;

            case CONT_LOCALC:
                // MSP is still running internal calibration
                if (calibration_state != CALIB_STOP) {
                    calibration_state = CALIB_CONTINUE;
                }
                break;

            case DONE_LOCALC:
                // write status to characteristic
                calibration_control = 2;
                simple_ble_notify_char(&calibration_control_char);

                // MSP has stopped internal calibration
                calibration_state = CALIB_GET_CONFIG;
                break;

            case START_SAMDATA:
                // MSP acknowledges, wait for data
                if (rawSample_state != RS_QUIT) {
                    rawSample_state = RS_WAIT_DATA;
                }
                break;

            case CONT_SAMDATA:
                // update data
                memcpy(raw_sample_data, &(buf[1]), len-1);
                simple_ble_update_char_len(&rawSample_char_data, len-1);

                // notify user of new data
                rawSample_status = 1;
                simple_ble_notify_char(&rawSample_char_status);
                if (rawSample_state != RS_QUIT) {
                    rawSample_state = RS_IDLE;
                }
                break;

            case DONE_SAMDATA:
                // notify user samples are done
                begin_rawSample = false;
                rawSample_status = 2;
                simple_ble_notify_char(&rawSample_char_status);

                // reset data
                memset(raw_sample_data, 0x00, SAMDATA_MAX_LEN);
                simple_ble_update_char_len(&rawSample_char_data, 1);

                rawSample_state = RS_NONE;
                break;

            default:
                // unhandled uart type. Don't handle it
                break;
        }
    } else {
        // expected a message but didn't receive one. Signal error status over
        //  status characteristic and try to stop whatever state we're in
        if (calibration_state == CALIB_WAIT_START) {
            status_code = STATUS_NO_CALIB_START;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_STOP;
        } else if (calibration_state == CALIB_WAIT_CONTINUE) {
            status_code = STATUS_NO_CALIB_CONTINUE;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_STOP;
        } else if (calibration_state == CALIB_WAIT_GET_CONFIG) {
            status_code = STATUS_NO_CALIB_GET_CONFIG;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_STOP;
        } else if (calibration_state == CALIB_WAIT_STOP) {
            status_code = STATUS_NO_CALIB_STOP;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            calibration_state = CALIB_NONE;
        } else if (rawSample_state == RS_WAIT_START) {
            status_code = STATUS_NO_RS_START;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            rawSample_state = RS_QUIT;
        } else if (rawSample_state == RS_WAIT_DATA) {
            status_code = STATUS_NO_RS_DATA;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            rawSample_state = RS_QUIT;
        } else if (rawSample_state == RS_WAIT_QUIT) {
            status_code = STATUS_NO_RS_QUIT;
            simple_ble_notify_char(&config_status_char);
            // return to default state
            rawSample_state = RS_NONE;
        }
    }
}

